<?php

//1. Определить количество цифр, меньших 5, используемых при записи натурального числа N.
function count_digits_less_than_5($n) {
	$count = 0; // инициализация счетчика
	while ($n > 0) { // продолжаем цикл пока число больше 0
		$digit = $n % 10; // получаем последнюю цифру числа
		if ($digit < 5) { // если цифра меньше 5, увеличиваем счетчик
			$count++;
		}
		$n = (int)($n / 10); // удаляем последнюю цифру числа
	}
	return $count; // возвращаем результат
}

echo count_digits_less_than_5(1234);
